{
  "updated": "2026-02-08 18:49:48",
  "count": 5,
  "news": [
    {
      "id": "57838295",
      "title": "Two High Schoolers Charged in Arizona Home Invasion Targeting $66M in Crypto",
      "url": "https://cryptonews.com/news/two-high-schoolers-charged-in-arizona-home-invasion-targeting-66m-in-crypto/",
      "source": "cryptonews",
      "published_on": "2026-02-08 18:42",
      "body": "Two teenagers from California are facing serious felony charges after authorities say they traveled hundreds of miles to carry out a violent home invasion in Scottsdale, Arizona, in a bid to obtain cryptocurrency believed to be worth $66 million. Key Takeaways: Two California teens allegedly traveled over 600 miles to carry out a violent home invasion targeting $66 million in cryptocurrency. Police arrested the suspects shortly after they fled the scene and recovered restraints and a 3D-printed ",
      "imageurl": "https://resources.cryptocompare.com/news/52/57838295.jpeg",
      "categories": "CRYPTOCURRENCY|SECURITY INCIDENTS"
    },
    {
      "id": "57838104",
      "title": "South Korea’s Bithumb Exchange Accidentally Sends $44 Billion in Bitcoin to Users",
      "url": "https://news.bitcoin.com/south-koreas-bithumb-exchange-accidentally-sends-44-billion-in-bitcoin-to-users/",
      "source": "Bitcoin.com",
      "published_on": "2026-02-08 18:30",
      "body": "South Korean cryptocurrency exchange Bithumb mistakenly distributed approximately 620,000 bitcoins, worth around $44 billion, to 695 customers during a promotional event. The company quickly acted to restrict trading and withdrawals, claiming to have recovered 99.7% of the erroneously distributed cryptocurrency within 35 minutes of the incident. The exchange emphasized that the mistake was not caused",
      "imageurl": "https://resources.cryptocompare.com/news/14/57838104.jpeg",
      "categories": "ASIA|BTC|EXCHANGE|TRADING|CRYPTOCURRENCY"
    },
    {
      "id": "57838229",
      "title": "The Last Window to Buy This Cheap Crypto at 50% Discount, Investors Rush in",
      "url": "https://www.cryptopolitan.com/the-last-window-to-buy-this-cheap-crypto-at-50-discount-investors-rush-in/",
      "source": "Cryptopolitan",
      "published_on": "2026-02-08 18:30",
      "body": "As expensive top cryptos show signs of saturation, a new altcoin wave of innovation is starting to capture the attention of experienced market participants. One emerging opportunity is moving into a late stage of its current cycle, creating a growing sense of urgency among those who closely follow new technology. This shift is not just about speculation. It reflects the move from ideas to working products. As the project prepares for its next big crypto milestone, the chance to engage at current",
      "imageurl": "https://resources.cryptocompare.com/news/43/57838229.jpeg",
      "categories": "BLOCKCHAIN|BUSINESS|MARKET|TRADING|CRYPTOCURRENCY"
    },
    {
      "id": "57838056",
      "title": "Could religion emerge naturally from large-scale AI systems?",
      "url": "https://www.cryptopolitan.com/religion-ai/",
      "source": "Cryptopolitan",
      "published_on": "2026-02-08 18:20",
      "body": "Religion developing inside machines sounds like science fiction, but can AI actually develop beliefs? The question might have seemed absurd just a few years ago, but artificial intelligence has reached an unexpected turning point. Computer programs built to answer questions and analyze information have started to show signs of something bigger and stranger: they have started developing what appears to be religious beliefs. The latest example comes from a social network called Moltbook, designed ",
      "imageurl": "https://resources.cryptocompare.com/news/43/57838056.jpeg",
      "categories": "EXCHANGE|TECHNOLOGY"
    },
    {
      "id": "57837647",
      "title": "Bitcoin Network Faces Unprecedented Decline in Mining Difficulty",
      "url": "https://en.coin-turk.com/bitcoin-network-faces-unprecedented-decline-in-mining-difficulty/",
      "source": "CoinTurk News",
      "published_on": "2026-02-08 18:08",
      "body": "Bitcoin mining difficulty saw a substantial 11.16% reduction recently. Price and natural conditions led to a significant decrease in hash rate. Continue Reading: Bitcoin Network Faces Unprecedented Decline in Mining Difficulty The post Bitcoin Network Faces Unprecedented Decline in Mining Difficulty appeared first on COINTURK NEWS .",
      "imageurl": "https://resources.cryptocompare.com/news/79/57837647.jpeg",
      "categories": "BTC|MINING|TRADING|CRYPTOCURRENCY"
    }
  ]
}